Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA.LipLength
Lip segment length.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Angle Cold Formed shape.
width:
Section width.
height:
Section height, depth.
wallNominalThickness:
Represents wall nominal thickness of rectangle.
wallDesignThickness:
Represents wall design thickness of rectangle.
innerFillet:
Inner Fillet - Corner fillet inner radius.
lipLength:
Lip segment length.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA
Defines parameters for Angle Cold Formed structural section.
Since:
2018